# Zadanije №1
# Напишіть код, який приймає вік користувача та за допомогою тернарного оператора визначає, чи може цей користувач голосувати. Якщо вік користувача 18 років і більше, програма повинна вивести “Може голосувати”, в іншому випадку – “Не може голосувати”.
wozrast = int(input("Введите ваш полный возраст: "))
messege = f"Вы можете голосовать." if wozrast > 17 else f"Вы не можете голосовать."
print(messege)

# Zadanije №2
# Напишіть код, який приймає ціле число та перевіряє, чи входить це число в діапазон від 10 до 20 включно. Використайте тернарний оператор для визначення результату. Якщо число входить у діапазон, програма повинна вивести “Число в діапазоні”, в іншому випадку – “Число поза діапазоном”.

num = int(input("Введити целое число: "))

result = "Число в диапазоне" if 10 <= num <= 20 else "Число вне диапазона"

print(result)