def draw_rhombus(n):
    if n % 2 == 0:
        print("Высота должна быть непарним числом.")
        return
# !!!!!!!!!!!!!ВНИМАНИЕ!!!!!!!!!!!!!!!!! ВЕРНЯЯ ЧАСТЬ!!!!!!!!!!!!!!!!!!!
    for i in range(n // 2 + 1):
        print(' ' * (n // 2 - i) + '*' * (2 * i + 1))
# !!!!!!!!!!!!!ВНИМАНИЕ!!!!!!!!!!!!!!!!! НИЖНЯЯ ЧАСТЬ!!!!!!!!!!!!!!!!!!!
    for i in range(n // 2 - 1, -1, -1):
        print(' ' * (n // 2 - i) + '*' * (2 * i + 1))


n = int(input("Введите высоту ромба (непарное число): "))
draw_rhombus(n)