"""
Боб працює водієм автобуса.
Проте він став надзвичайно популярним серед мешканців міста.
Через те, що так багато пасажирів хочуть сісти в його автобус,
іноді він стикається з проблемою нестачі місця в автобусі!
Він хоче, щоб ви написали просту програму, яка повідомить йому, чи зможе він вмістити всіх пасажирів.

Огляд Завдання

Вам потрібно написати функцію, яка приймає три параметри:

 • cap — це кількість людей, яку автобус може вмістити, не враховуючи водія.
 • on — кількість людей в автобусі, не враховуючи водія.
 • wait — кількість людей, які чекають на посадку в автобус, не враховуючи водія.

Якщо місця достатньо, поверніть 0, а якщо ні, поверніть кількість пасажирів, яких він не може взяти.

Приклади використання

 • cap = 10, on = 5, wait = 5 –> 0 (Він може вмістити всіх 5 пасажирів)
 • cap = 100, on = 60, wait = 50 –> 10 (Він не може вмістити 10 з 50 пасажирів, що чекають)
Підказка
Є три інпути
cap
on
wait
треба порахувати чи on + wait < cap та вивести на екран повідомлення із загальною кількістью місць і кількістю після посадки (on + wait)
"""


cap = int(input("Please put cap\n"))
on = int(input("Please put on\n"))
wait = int(input("Please put wait\n"))

free_places = cap - on
all_places = wait - free_places

if all_places > 0:
 print(f"Автобус не може вмістити ще {all_places} людей")
else:
 print("Всі пасажири влізли")

