text = ("Ми вирішили прогулятися старим містом. "
        "Вулички були вимощені бруківкою, "
        "а будинки мали старі дерев’яні двері. "
        "Зайшовши в один зі старих магазинів, "
        "ми знайшли багато цікавих речей. "
        "Особливо мене вразила стара карта міста. "
        "Ми довго роздивлялися її, намагаючись знайти місця, "
        "які згадувалися в старих книгах. "
        "Коли вже смеркало, ми сіли на лавку в старому парку "
        "і спостерігали за заходом сонця.")

result = text.replace("стар", "нов")
print(result)
