# Написати програму, що дозволяє користувачу ввести назву кольору, який буде використовуватися для малювання.
# Програма має змінити колір пера (pencolor()) відповідно до користувацького вводу.
# Створити малюнок за допомогою черепашки, де не має бути видимих перетинів ліній.
# Використовувати penup() та pendown() для контролювання, коли черепашка залишає слід.
# Створити програму, яка дозволяє користувачу вибирати форму та колір черепашки.
# Учень має додати опції для зміни цих параметрів на початку виконання програми.
# Створити просту анімацію, де черепашка малює квадрат, але змінює свою швидкість (speed()) після кожної сторони.


import turtle


screen = turtle.Screen()

turtle = turtle.Turtle()
turtle.speed(1)

turtle.forward(90)
turtle.backward(90)

turtle.penup()

turtle.goto(0, 90)

turtle.pendown()
turtle.forward(90)
turtle.backward(90)


screen.mainloop()
